app/Orchid/Screens/Navigation/NavigationScreen.php

    public function query(): iterable
    {
        return [
            'navigations' => Navigation::all(),
        ];
---
select * from `navigations`