app/Orchid/Screens/Navigation/NavigationEditScreen.php

    public function query(NavigationItem $NavigationItems): array
    {
        $id = request()->route('id');
        $NavigationItems = NavigationItem::where('navigation_id', $id)
            ->with(['translations' => function ($query) {
                $query->where('locale', 'cs');
            }])->get();
---
select * from `navigation_items` where `navigation_id` = '1'

    public function asyncloadMenuItemData(Request $request, $id)
    {
        $NavigationItem = NavigationItem::findOrFail($id);
---
select * from `navigation_items` where `navigation_items`.`id` = '5' limit 1

    public function updateMenuItem(Request $request, $id)
    {
        //  dd($request, $id);
        $request->validate([
            'menuCategoryItem.name' => 'required|string',
            'menuCategoryItem.url' => 'required|string',
        ]);

        $NavigationItem = NavigationItem::with('translations')->findOrFail($id);

        // Aktualizace NavigationItem
        $NavigationItem->url = $request['menuCategoryItem']['url'];
        $NavigationItem->save();

        // Najděte překlad pro daný jazyk, například 'cs'
        $translation = $NavigationItem->translations->firstWhere('locale', 'cs');

        // Pokud překlad existuje, aktualizujte ho
        if ($translation) {
            $translation->title = $request['menuCategoryItem']['name'];
            $translation->save();
---
select * from `navigation_items` where `navigation_items`.`id` = '9' limit 1
update `navigation_item_translations` set `title` = 'aaaaaa44114', `navigation_item_translations`.`updated_at` = '2024-04-21 00:29:41' where `id` = 7